app/controllers/flights_controller.rb

  def index
    #@flights=Flight.all
    @departure_airport = Airport.all.map{|a| [a.code, a.id]}
    @arrival_airport = Airport.all.map{ |a| [ a.code, a.id ] }
    @flight_date = Flight.all.map{ |a| [ a.start_datetime, a.id ] }
---
SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"